[
  {
    "path": "posts/2025-06-06-reflections-on-the-first-international-education-congress-in-turkey/",
    "title": "Reflections on the First International Education Congress in Ankara, Turkey",
    "description": "In this blog post, I share my experiences and key takeaways from attending the First International Education Congress organized by the Turkish Ministry of Education in Ankara, Turkey.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2025-06-06",
    "categories": [],
    "contents": "\r\nBetween June 3 and 4, I had the pleasure of attending the First International Education Congress organized by the Turkish Ministry of Education in Ankara, Turkey. The event, (see egitimkongre.meb.gov.tr), brought together educators, policymakers, and researchers from around the world to discuss the latest developments in education.\r\nThe main theme of the congress was the launch of the Türkiye Yüzyılı Maarif Modeli, a new curriculum framework designed to shape the future of education in Turkey. The congress served as a dynamic platform for sharing perspectives on how this model can transform classrooms and support student learning in the coming decades.\r\nOn June 3, I had the honor of being one of the panelists in a session dedicated to educational assessment. My talk, titled “Rethinking Assessment through AI: Promises, Pitfalls, and Paths Forward,” focused on the transformative potential—and the challenges—of integrating artificial intelligence (AI) into student evaluation.\r\n\r\nDuring my talk, I shared my thoughts on how generative AI and other advanced technologies are reshaping the way we evaluate student learning. These tools can enhance efficiency and provide more personalized feedback, but they also come with significant risks. For instance, low AI literacy among teachers may hinder effective use, and an overreliance on AI could lead to a loss of critical thinking skills and undermine the authenticity of student work.\r\nBeyond my presentation, I thoroughly enjoyed connecting with colleagues and exchanging ideas on how education is evolving in the age of artificial intelligence. It was inspiring to see so many passionate educators working to build a future where AI is harnessed responsibly to enhance learning outcomes.\r\nI am grateful to the organizers for creating such a vibrant and thought-provoking event. As we move forward, I look forward to continuing these conversations and contributing to the ongoing development of innovative, ethical, and effective educational practices in the age of AI.\r\nRETURN TO THE NEWS PAGE\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-06-06-reflections-on-the-first-international-education-congress-in-turkey/meb.png",
    "last_modified": "2025-06-06T07:19:53-06:00",
    "input_file": {},
    "preview_width": 2297,
    "preview_height": 1455
  },
  {
    "path": "posts/2025-02-22-crame-cemo-joint-colloquium/",
    "title": "CRAME-CEMO Joint Colloquium",
    "description": "Our talk on computerized adaptive testing and response times in the \nupcoming online colloquium.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2025-02-22",
    "categories": [],
    "contents": "\r\nDr. Esther Ulitzsch from the Centre for Educational Measurement (CEMO) at the University of Oslo and I have decided to organize a series of online colloquiums to share our research with each other and build a connection between the two centres (CRAME and CEMO).\r\nThe first colloquium will be on March 3, 2025 from 8:30 am to 9:30 am (via Zoom). In this presentation, Joyce and I will present our ongoing research on the integration of response time with computerized adaptive testing (see the flyer below for further details). The Zoom link for our presentation is https://bit.ly/3EQ7Ole. We look forward to seeing you there!\r\n\r\nRETURN TO THE NEWS PAGE\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-02-22-crame-cemo-joint-colloquium/cat_rt.png",
    "last_modified": "2025-02-22T22:14:10-07:00",
    "input_file": {},
    "preview_width": 1024,
    "preview_height": 1024
  },
  {
    "path": "posts/2025-01-19-genai-in-higher-education/",
    "title": "Generative AI in Higher Education",
    "description": "My recent interview in the Gateway on the effect of growing artificial intelligence usage in education.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2025-01-19",
    "categories": [],
    "contents": "\r\nI recently had the opportunity to be interviewed by The Gateway, the official student newspaper of the University of Alberta. During the interview, I shared insights on how the growing use of generative AI is shaping teaching and learning activities in education.\r\nWe discussed both the challenges and opportunities that generative AI tools bring to classrooms and explored ways educators can adapt to this rapidly evolving landscape.\r\nYou can read the full interview online here.\r\nThank you for your continued interest in my work, and I look forward to hearing your thoughts!\r\nRETURN TO THE NEWS PAGE\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-01-19-genai-in-higher-education/gatewaylogo.png",
    "last_modified": "2025-02-22T21:58:29-07:00",
    "input_file": {},
    "preview_width": 793,
    "preview_height": 226
  }
]
